spectran/CDJ-100S-STM32F7-Display/Src/display.c
void HLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint32_t color)
{
	uint32_t Xaddress = 0;
    Xaddress = (hltdc.LayerCfg[ActiveLayer].FBStartAdress) + 2*(hltdc.LayerCfg[ActiveLayer].ImageWidth*Ypos + Xpos);
	/* Write line */
	hdma2d.Init.Mode = DMA2D_R2M;
	/* RGB565 format */
	hdma2d.Init.ColorMode = DMA2D_RGB565;
	hdma2d.Init.OutputOffset = 0;
	hdma2d.Instance = DMA2D;
	/* DMA2D Initialization */
	if(HAL_DMA2D_Init(&hdma2d) == HAL_OK) {
	 	if(HAL_DMA2D_ConfigLayer(&hdma2d, ActiveLayer) == HAL_OK) {
	   		if (HAL_DMA2D_Start(&hdma2d, color, Xaddress, Length, 1) == HAL_OK) {
	   			/* Polling For DMA transfer */
	   			HAL_DMA2D_PollForTransfer(&hdma2d, 10);
	   		}
	   	}
	}
}

void Rectangle(uint16_t Xpos, uint16_t Ypos, uint16_t Xsize, uint16_t Ysize, uint32_t color)
{
	uint32_t xpos = hltdc.LayerCfg[ActiveLayer].FBStartAdress+2*(hltdc.LayerCfg[ActiveLayer].ImageWidth*Ypos+Xpos);
	hdma2d.Init.OutputOffset = hltdc.LayerCfg[ActiveLayer].ImageWidth - Xsize;
	if(HAL_DMA2D_Init(&hdma2d) == HAL_OK) {
		if (HAL_DMA2D_Start(&hdma2d, color, xpos, Xsize, Ysize) == HAL_OK) {
			HAL_DMA2D_PollForTransfer(&hdma2d, 100);
		}
	}

}

void Pixel(uint16_t Xpos, uint16_t Ypos, uint32_t color)
{
	*(__IO uint16_t*) (hltdc.LayerCfg[ActiveLayer].FBStartAdress + (2*(Ypos*hltdc.LayerCfg[ActiveLayer].ImageWidth + Xpos))) = Color_Convertion(color);
}

void DrawDigit(uint8_t digit, uint16_t Xpos, uint16_t Ypos, uint8_t width, uint32_t color)
{
	switch(digit) {
	case 0: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// f
		VLine(Xpos, Ypos + 1, width - 2, color);
		VLine(Xpos + 1, Ypos + 2, width - 4, color);
		// e
		VLine(Xpos, Ypos + width, width - 2, color);
		VLine(Xpos + 1, Ypos + width + 1, width - 4, color);
		// d
		HLine(Xpos + 1, Ypos + (width * 2) - 2, width - 2, color);
		HLine(Xpos + 2, Ypos + (width * 2) - 3, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	case 1: {
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	case 2: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// e
		VLine(Xpos, Ypos + width, width - 2, color);
		VLine(Xpos + 1, Ypos + width + 1, width - 4, color);
		// d
		HLine(Xpos + 1, Ypos + (width * 2) - 2, width - 2, color);
		HLine(Xpos + 2, Ypos + (width * 2) - 3, width - 4, color);
		// g
		HLine(Xpos + 1, Ypos + width - 1, width - 2, color);
		HLine(Xpos + 2, Ypos + width - 2, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	case 3: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// d
		HLine(Xpos + 1, Ypos + (width * 2) - 2, width - 2, color);
		HLine(Xpos + 2, Ypos + (width * 2) - 3, width - 4, color);
		// g
		HLine(Xpos + 1, Ypos + width - 1, width - 2, color);
		HLine(Xpos + 2, Ypos + width - 2, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	case 4: {
		// f
		VLine(Xpos, Ypos + 1, width - 2, color);
		VLine(Xpos + 1, Ypos + 2, width - 4, color);
		// g
		HLine(Xpos + 1, Ypos + width - 1, width - 2, color);
		HLine(Xpos + 2, Ypos + width - 2, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	case 5: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// f
		VLine(Xpos, Ypos + 1, width - 2, color);
		VLine(Xpos + 1, Ypos + 2, width - 4, color);
		// d
		HLine(Xpos + 1, Ypos + (width * 2) - 2, width - 2, color);
		HLine(Xpos + 2, Ypos + (width * 2) - 3, width - 4, color);
		// g
		HLine(Xpos + 1, Ypos + width - 1, width - 2, color);
		HLine(Xpos + 2, Ypos + width - 2, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		break;
	}
	case 6: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// f
		VLine(Xpos, Ypos + 1, width - 2, color);
		VLine(Xpos + 1, Ypos + 2, width - 4, color);
		// e
		VLine(Xpos, Ypos + width, width - 2, color);
		VLine(Xpos + 1, Ypos + width + 1, width - 4, color);
		// d
		HLine(Xpos + 1, Ypos + (width * 2) - 2, width - 2, color);
		HLine(Xpos + 2, Ypos + (width * 2) - 3, width - 4, color);
		// g
		HLine(Xpos + 1, Ypos + width - 1, width - 2, color);
		HLine(Xpos + 2, Ypos + width - 2, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		break;
	}
	case 7: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	case 8: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// f
		VLine(Xpos, Ypos + 1, width - 2, color);
		VLine(Xpos + 1, Ypos + 2, width - 4, color);
		// e
		VLine(Xpos, Ypos + width, width - 2, color);
		VLine(Xpos + 1, Ypos + width + 1, width - 4, color);
		// d
		HLine(Xpos + 1, Ypos + (width * 2) - 2, width - 2, color);
		HLine(Xpos + 2, Ypos + (width * 2) - 3, width - 4, color);
		// g
		HLine(Xpos + 1, Ypos + width - 1, width - 2, color);
		HLine(Xpos + 2, Ypos + width - 2, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	case 9: {
		// a
		HLine(Xpos + 1, Ypos, width - 2, color);
		HLine(Xpos + 2, Ypos + 1, width - 4, color);
		// f
		VLine(Xpos, Ypos + 1, width - 2, color);
		VLine(Xpos + 1, Ypos + 2, width - 4, color);
		// d
		HLine(Xpos + 1, Ypos + (width * 2) - 2, width - 2, color);
		HLine(Xpos + 2, Ypos + (width * 2) - 3, width - 4, color);
		// g
		HLine(Xpos + 1, Ypos + width - 1, width - 2, color);
		HLine(Xpos + 2, Ypos + width - 2, width - 4, color);
		// c
		VLine(Xpos + width - 1, Ypos + width, width - 2, color);
		VLine(Xpos + width - 2, Ypos + width + 1, width - 4, color);
		// b
		VLine(Xpos + width - 1, Ypos + 1, width - 2, color);
		VLine(Xpos + width - 2, Ypos + 2, width - 4, color);
		break;
	}
	}
}

void DrawString(char* str, uint16_t Xpos, uint16_t Ypos, uint32_t color, uint32_t fontcolor)
{
	hdma2d.Init.Mode = DMA2D_R2M;
	hdma2d.Init.ColorMode = DMA2D_RGB565;
	hdma2d.Init.OutputOffset = Xpos;
	hdma2d.Instance = DMA2D;
	if(HAL_DMA2D_Init(&hdma2d) == HAL_OK)
	{
		if(HAL_DMA2D_ConfigLayer(&hdma2d, ActiveLayer) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&hdma2d, fontcolor, hltdc.LayerCfg[ActiveLayer].FBStartAdress + 2*(480*(Ypos-20)+Xpos),
					480-Xpos, 20) == HAL_OK)
			{
				HAL_DMA2D_PollForTransfer(&hdma2d, 10);
			}
		}
	}
	int xpos = Xpos + 5;
	Ypos -= 4;
	uint16_t k = 0;
	int i = 0;
	int l = 0;
	while(str[l] != 0) {
		if((str[l] > 32) && (str[l] < 128)) {
			i = 0;
			do {
				k = 0;
				if(xpos < 470) {
					while(k < 13) {
						if(((font[(str[l]-33)*12+i] >> k) & 1) == 1) {
							*(__IO uint16_t*)(hltdc.LayerCfg[ActiveLayer].FBStartAdress + (2 * ((Ypos - k)
									* hltdc.LayerCfg[ActiveLayer].ImageWidth + xpos + i))) = color;
						}
						else {
							*(__IO uint16_t*)(hltdc.LayerCfg[ActiveLayer].FBStartAdress + (2 * ((Ypos - k)
									* hltdc.LayerCfg[ActiveLayer].ImageWidth + xpos + i))) = Color_Convertion(fontcolor);
						}
						k++;
					}
				}
				if(font[(str[l]-33)*12+i] == 0) {
					if(font[(str[l]-33)*12+i+1] == 0) {
						i++;
						break;
					}
					i++;
				}
				else {
					i++;
				}
			}
			while(i < 12);
			xpos += i;
		}
		if(str[l] > 191) {
			i = 0;
			do {
				k = 0;
				if(xpos < 470) {
					while(k < 13) {
						if(((ru_font[(str[l]-192)*12+i] >> k) & 1) == 1) {
							*(__IO uint16_t*)(hltdc.LayerCfg[ActiveLayer].FBStartAdress + (2 * ((Ypos - k)
									* hltdc.LayerCfg[ActiveLayer].ImageWidth + xpos + i))) = color;
						}
						else {
							*(__IO uint16_t*)(hltdc.LayerCfg[ActiveLayer].FBStartAdress + (2 * ((Ypos - k)
									* hltdc.LayerCfg[ActiveLayer].ImageWidth + xpos + i))) = Color_Convertion(fontcolor);
						}
						k++;
					}
				}
				if(ru_font[(str[l]-192)*12+i] == 0) {
					if(ru_font[(str[l]-192)*12+i+1] == 0) {
						i++;
						break;
					}
					i++;
				}
				else {
					i++;
				}
			}
			while(i < 12);
			xpos += i;
		}
		if(str[l] == 32) {
			xpos += 5;
		}
		l++;
	}
}

// snaps file position on the spectra to the nearest beat
uint32_t QuantizePosition(int beat_offset) {
	uint32_t quantized_pos = file_pos_wide;
	int32_t time1 = file_pos_wide - rekordbox.timeindex[beat]*150/1000;
	int32_t time2 = rekordbox.timeindex[beat+1]*150/1000 - file_pos_wide;
	if(time1 > time2) {
		quantized_pos = rekordbox.timeindex[beat+beat_offset+1]*150/1000;							;
	}
	else {
		quantized_pos = rekordbox.timeindex[beat+beat_offset]*150/1000;
	}
	return quantized_pos;
}

// get loop length in the units of 1/32 beat
/*uint16_t GetLoopLength() {
	uint16_t loop_length = 0;
	uint32_t beatlength = (rekordbox.timeindex[beat+1] -
			rekordbox.timeindex[beat])*150/1000;
	display.looplength = display.loopend - display.loopstart;
	loop_length = (uint16_t)((float)display.looplength /
			(float)beatlength * 32) / 32;
	return loop_length * 32;
}*/
